public class Main { //07.12.23

    /**
     *
     * Представьте, что вам необходимо разработать программу для управления библиотекой книг.
     * У каждой книги должны быть свойства, такие как название, автор, жанр и год издания.
     * Ваша программа должна предоставлять следующие функции:

     1. Добавление новой книги в библиотеку.
     2. Удаление книги из библиотеки.
     3. Поиск книги по названию или автору.
     4. Вывод списка всех книг в библиотеке.

     Вы можете решить эту задачу, создав класс "Книга" с соответствующими свойствами и методами для доступа к ним.
     Затем вы можете создать класс "Библиотека", который будет содержать список книг и реализует методы
     для добавления,удаления и поиска книг по различным критериям.

     */

    public static void main(String[] args) throws NegativeException {
        Beginning beginning = new Beginning(); //создали объект
        beginning.beginning1(); //вызвали метод



    }

}